local function run(msg, matches) 
  
if matches[1] == 'Set mode' or matches[1] == 'تنظیم مدیر و مالک' and is_mod(msg) then
return [[
" *مالک* `[یوزرنیم|ایدی|ریپلی]` 
_انتخاب مالک گروه(قابل انتخاب چند مالک)_

*حذف مالک* `[یوزرنیم|ایدی|ریپلی]` 
 _حذف کردن فرد از فهرست مالکان گروه_

 *لیست مالکان*
_نمایش فهرست مالکان گروه_ 

*مدیر* `[یوزرنیم|ایدی|ریپلی]` 
_ارتقا مقام کاربر به مدیر گروه_

*حذف مدیر* `[یوزرنیم|ایدی|ریپلی]` 
_تنزیل مقام مدیر به کاربر_

*لیست مدیران* 
_نمایش فهرست مدیران گروه_ "]]
 end
 
 if matches[1] == 'Set flood' or matches[1] == 'تنظیم رگباری' and is_mod(msg) then
return [[
" *تنظیم پیام مکرر* `[2-50]`
_تنظیم حداکثر تعداد پیام مکرر_

*حداکثر حروف مجاز* `[عدد]`
_تنظیم حداکثر کاراکتر پیام مکرر_

*تنظیم زمان بررسی* `[1-10]`
_تنظیم زمان ارسال پیام مکرر_ "]]
		
	end

 if matches[1] == 'Set mute and ban' or matches[1] == 'تنظیم اخراج و سکوت' and is_sudo(msg) then
return [[
"*سکوت* `[یوزرنیم|ایدی|ریپلی]` 
_بیصدا کردن کاربر در گروه_

*حذف سکوت* `[یوزرنیم|ایدی|ریپلی]` 
_در آوردن کاربر از حالت بیصدا در گروه_

*لیست سکوت*
_نمایش فهرست افراد بیصدا_

*اخراج* `[یوزرنیم|ایدی|ریپلی]` 
_حذف کاربر از گروه_

*بن* `[یوزرنیم|ایدی|ریپلی]` 
_مسدود کردن کاربر از گروه_

*حذف بن* `[یوزرنیم|ایدی|ریپلی]` 
_در آوردن از حالت مسدودیت کاربر از گروه_

*لیست بن*
_نمایش افراد مسدود شده از گروه_"]]
 end
 
  if matches[1] == 'Lock and silence' or matches[1] == 'تنظیم قفل و بیصدا' and is_sudo(msg) then
return [[
"*قفل* `[لینک | ورود | تگ | ویرایش | عربی | وب | ربات |هرزنامه | پیام مکرر | فونت | فراخوانی | سنجاق]`
_در صورت قفل بودن فعالیت ها, ربات آنهارا حذف خواهد کرد_

*باز کردن* `[لینک | ورود | تگ | ویرایش | عربی | وب | ربات |هرزنامه | پیام مکرر | فونت | فراخوانی | سنجاق]`
_در صورت قفل نبودن فعالیت ها, ربات آنهارا حذف نخواهد کرد_

*تنظیمات*
_نمایش تنظیمات گروه_

*~~*

*بیصدا* `[همه | تصاویر متحرک | عکس | اسناد | برچسب | صفحه کلید | فیلم | متن | نقل قول | موقعیت | اهنگ | صدا | مخاطب | کیبورد شیشه ای|بازی|خدمات تلگرام]`
_در صورت بیصدا بودن فعالیت ها, ربات آنهارا حذف خواهد کرد_

*باصدا* `[همه | تصاویر متحرک | عکس | اسناد | برچسب | صفحه کلید | فیلم | متن | نقل قول | موقعیت | اهنگ | صدا | مخاطب | کیبورد شیشه ای|بازی|خدمات تلگرام]`
_در صورت بیصدا نبودن فعالیت ها, ربات آنهارا حذف نخواهد کرد_

*لیست بیصدا*
_نمایش فهرست بیصدا های گروه_"]]
 end

  if matches[1] == 'Help gp' or matches[1] == 'تنظیمات کاربردی' and is_sudo(msg) then
return [[
 "*تنظیم*`[قوانین | نام | لینک | درباره | خوشامد]`
_ربات آنهارا ثبت خواهد کرد_

*پاک کردن* `[بن | مدیران | ربات | قوانین | درباره | لیست سکوت | خوشامد]`   
_ربات آنهارا پاک خواهد کرد_"]]
 end
 
   if matches[1] == 'More options' or matches[1] == 'تنظیمات اضافه' and is_sudo(msg) then
return [[
"*لیست سفید* `[+|-]` `[یوزرنیم|ایدی|ریپلی]` 
_افزودن افراد به لیست سفید_

*لیست سفید*
_نمایش افراد سفید شده از گروه_

*فیلتر* `[کلمه]`
_فیلتر‌کلمه مورد نظر_

*حذف فیلتر* `[کلمه]`
_ازاد کردن کلمه مورد نظر_

*لیست فیلتر*
_نمایش لیست کلمات فیلتر شده_

*سنجاق* `[reply]`
_ربات پیام شمارا در گروه سنجاق خواهد کرد_

*حذف سنجاق* 
_ربات پیام سنجاق شده در گروه را حذف خواهد کرد_

*اطلاعات فرد*
_نمایش اطلاعات حساب شما یا فردی که ریپلی کرده باشید یا فردی که ایدی آن را مقابل دستور گذاشته باشید_

*ایدی*
_نمایش شناسه شما و گروه_

*!خوشامد فعال/غیرفعال*
_فعال یا غیرفعال کردن خوشامد گویی_

*تنظیم خوشامد [متن]*
_ثبت پیام خوش آمد گویی_

*قوانین*
_نمایش قوانین گروه_

*درباره*
_نمایش درباره گروه_

*اطلاعات گروه*
_نمایش اطلاعات گروه_

*اعتبار*
_استعلام مانده شارژ ربات در گروه_

*لینک*
_نمایش لینک گروه_

*تنظیم لینک*
_تنظیم لینک جدید برای گروه_

*~~~~~~~*

*تنظیمات کلی*
_نمایش تنظیمات بصورت دکمه شیشه‌ای_

*~~~~~~~*

*‌پاک کردن*
_پاکسازی تمام پیامهای گروه_

*~~~~~~~*

*mt دقیقه ساعت*
_قفل ساعتی گروه_

*unmt*
_دراوردن گروه از حالت قفل ساعتی_

*~~~~~~~*
*lock add*
_روشن کردن اد اجباری_

 *setadd تعداد*
 _تنظیم تعداد اد اجباری_
 
 *unlock add*
 _غیرفعال کردن اد اجباری_
 
 *~~~~~~~*
 
*زبان انگلیسی*
_تنظیم زبان انگلیسی_

*زبان فارسی*
_تنظیم زبان فارسی_

*دستورات انگلیسی*
_تنظیم دستورات انگلیسی_

*دستورات فارسی*
_تنظیم دستورات فارسی_"]]
 end
 
   if matches[1] == 'Today' or matches[1] == 'امروز بهم گل ندادی 😐' and is_sudo(msg) then
return " ببخشید مدیر بفرمایین 🌸💐🌷🌹🥀🌺😊❤️"
 end
 
  if matches[1] == 'my bot' or matches[1] == 'ربات جون' and is_admin(msg) then
return " گــیــان عـشـق مـن اویــن❤️"
 end
 
if matches[1] == 'mehdi' or matches[1] == 'مهدی' then
if not is_sudo(msg) then
 return "مــدیــر کــجـایـی بـا شـمـا کـار دارن"
end
end
end
return {
  patterns = {
    "^([Ss]et mode)$",
	"^([Ss]et flood)$",
	"^(Set mute and ban)$",
	"^(Lock and silence)$",
	"^(Help gp)$",
    "^(More options)$",
	"^(Help gp)$",
	"^(تنظیم مدیر و مالک)$",
	"^(تنظیم رگباری)$",
	"^(تنظیم اخراج و سکوت)$",
	"^(تنظیم قفل و بیصدا)$",
	"^(تنظیمات کاربردی)$",
	"^(تنظیمات اضافه)$",
	"^(ربات جون)$",
	"^(امشب چطوری؟)$",
	"^(ربات من)$",
	"^(امروز بهم گل ندادی 😐)$"
  },
  run = run
}

-- @Mrr619